Revit 2027 API
BuiltInFailures.PlanRegionFailures.Nested Property
 Cannot have nested Plan Regions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId Nested { get; }
Public Shared ReadOnly Property Nested As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ Nested {
	FailureDefinitionId^ get ();
}
static member Nested : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PlanRegionFailures Class
Autodesk.Revit.DB Namespace